NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/MGM12/MGM12P02F1024GA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ETM</name>
      <description>ETM</description>
      <baseAddress>0xE0041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00040000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ETMCR</name>
          <description>Main Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000411</resetValue>
          <resetMask>0x10632FF1</resetMask>
          <fields>
            <field>
              <name>POWERDWN</name>
              <description>ETM Control in low power mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTSIZE</name>
              <description>ETM Port Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall Processor</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRANCHOUTPUT</name>
              <description>Branch Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGREQCTRL</name>
              <description>Debug Request Control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETMPROG</name>
              <description>ETM Programming</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETMPORTSEL</name>
              <description>ETM Port Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTMODE2</name>
              <description>Port Mode[2]</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTMODE</name>
              <description>Port Mode Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPORTSIZE</name>
              <description>Port Size[3]</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTAMPEN</name>
              <description>Time Stamp Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCCR</name>
          <description>Configuration Code Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8C802000</resetValue>
          <resetMask>0x8FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADRCMPPAIR</name>
              <description>Number of Address Comparator Pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATACMPNUM</name>
              <description>Number of Data Value Comparators</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMDECCNT</name>
              <description>Number of Memeory Map Decoders</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COUNTNUM</name>
              <description>Number of Counters</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQPRES</name>
              <description>Sequencer Present</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTINPNUM</name>
              <description>Number of External Inputs</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Zero inputs presents</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One inputs presents</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two inputs presents</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTOUTNUM</name>
              <description>Number of External Output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOFULLPRES</name>
              <description>FIFIO FULL present</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDCOMPNUM</name>
              <description>Number of context ID Comparators</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRACESS</name>
              <description>Trace Start/Stop Block Present</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMACCESS</name>
              <description>Coprocessor and Memeory Access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETMID</name>
              <description>ETM ID Register Present</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMTRIGGER</name>
          <description>ETM Trigger Event Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>RESA</name>
              <description>ETM Resource A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESB</name>
              <description>ETM Resource B</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETMFCN</name>
              <description>ETM Function</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMSR</name>
          <description>ETM Status Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>ETHOF</name>
              <description>ETM Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETMPROGBIT</name>
              <description>ETM Programming Bit Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRACESTAT</name>
              <description>Trace Start/Stop Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGBIT</name>
              <description>Trigger Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMSCR</name>
          <description>ETM System Configuration Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00020D09</resetValue>
          <resetMask>0x00027F0F</resetMask>
          <fields>
            <field>
              <name>MAXPORTSIZE</name>
              <description>Maximum Port Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFO FULL Supported</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXPORTSIZE3</name>
              <description>Max Port Size[3]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORTSIZE</name>
              <description>Port Size Supported</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PORTMODE</name>
              <description>Port Mode Supported</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROCNUM</name>
              <description>Number of Supported Processros</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOFETCHCOMP</name>
              <description>No Fetch Comparison</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMTEEVR</name>
          <description>ETM TraceEnable Event Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>RESA</name>
              <description>ETM Resource A Trace Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESB</name>
              <description>ETM Resource B Trace Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETMFCNEN</name>
              <description>ETM Function Trace Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMTECR1</name>
          <description>ETM Trace control Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>ADRCMP</name>
              <description>Address Comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMMAP</name>
              <description>Memmap</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCEXCTL</name>
              <description>Trace Include/Exclude Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCE</name>
              <description>Trace Control Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMFFLR</name>
          <description>ETM Fifo Full Level Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BYTENUM</name>
              <description>Bytes left in FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCNTRLDVR1</name>
          <description>Counter Reload Value</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Free running counter reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMSYNCFR</name>
          <description>Synchronisation Frequency Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000400</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Synchronisation Frequency Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMIDR</name>
          <description>ID Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4114F253</resetValue>
          <resetMask>0xFF1DFFFF</resetMask>
          <fields>
            <field>
              <name>IMPVER</name>
              <description>Implementation Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETMMINVER</name>
              <description>Minor ETM Architecture Version</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETMMAJVER</name>
              <description>Major ETM Architecture Version</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROCFAM</name>
              <description>Implementer Code</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCF</name>
              <description>Load PC First</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>THUMBT</name>
              <description>32-bit Thumb Instruction Tracing</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECEXT</name>
              <description>Security Extension Support</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BPE</name>
              <description>Branch Packet Encoding</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPCODE</name>
              <description>Implementer Code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCCER</name>
          <description>Configuration Code Extension Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x18541800</resetValue>
          <resetMask>0x387FFFFB</resetMask>
          <fields>
            <field>
              <name>EXTINPSEL</name>
              <description>Extended External Input Selectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTINPBUS</name>
              <description>Extended External Input Bus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READREGS</name>
              <description>Readable Registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DADDRCMP</name>
              <description>Data Address comparisons</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSTRES</name>
              <description>Instrumentation Resources</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EICEWPNT</name>
              <description>EmbeddedICE watchpoint inputs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEICEWPNT</name>
              <description>Trace Sart/Stop Block Uses EmbeddedICE watchpoint inputs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EICEIMP</name>
              <description>EmbeddedICE Behavior control Implemented</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMP</name>
              <description>Timestamping Implemented</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFCNT</name>
              <description>Reduced Function Counter</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TENC</name>
              <description>Timestamp Encoding</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSIZE</name>
              <description>Timestamp Size</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
